Revit 2027 API
UnitUtils.GetDiscipline Method
 Gets the discipline for a given measurable spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GetDiscipline(
	ForgeTypeId specTypeId
)
Public Shared Function GetDiscipline (
	specTypeId As ForgeTypeId
) As ForgeTypeId
public:
static ForgeTypeId^ GetDiscipline(
	ForgeTypeId^ specTypeId
)
static member GetDiscipline :
        specTypeId : ForgeTypeId -> ForgeTypeId
Parameters
specTypeId ForgeTypeId
 Identifier of the measurable spec.
Return Value
ForgeTypeId
 Identifier of the discipline.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace